export default {
    published: true,
    modified: '2022-01-03 16:02:42',
    done: true,
    title: '인터뷰를 정리하자',
    tags: ['인터뷰를 정리하자'],
    categories: ['CS'],
    authors: ['kimson'],
    wrote: '2021-12-06 18:14:35',
    toc: true,
    content: [`
        <div>
            <div class="mt-3">
                <span class="h3">모 회사 1차 면접</span>
            </div>
            <div>
                <div>
                    <span class="h6">면접 분위기</span>
                </div>
                <p>면접을 보기 위해 아침 일찍 나와야 했습니다. 출근시간보다 더 빠른 시간에 보는 게 지방에 사는 저로서는 오는 길조차 체력의 반을 써야했습니다. 재량을 두고 저를 알리는 자리이니 이러한 불편은 감수해야하지만 힘든건 부정 못하겠네요.</p>
                <p>면접은 난생 처음 <kbd>다대다</kbd>방식. 심지어 면접도 형식 갖춰서 하는 경험도 전무했던지라 머리가 새하얗게 비었습니다. (이전 직장은 상무님 아들얘기만 듣다가 끝난던 기억이)</p>
                <div>
                    <span class="h6">면접 질문</span>
                </div>
                <p>그렇게 어려운 질문을 없었습니다만, 물론 준비 못한 저는 어려웠습니다. 실컷 파일로 만들어둔 포트폴리오를 첨부도 못하고 면접 도중에 알았으니 속으로는 너무 당황해서 머리가 새하얘졌습니다.</p>
                <p>각설하고 질문은 크게 <span class="fw-bold">자기소개</span>, <span class="fw-bold">프로젝트 관련</span>, <span class="fw-bold">코딩테스트</span> 관련 질문, <span class="fw-bold">자기계발</span> 등의 질문이었습니다.</p>
                <p><span class="fw-bold">자기소개</span>는 그저 저는 누구예요 하고 끝나는 것으로 생각했던 저는 불행 중 불행으로 두번째 순번이었고, 기가막히게 옆 사람이 자기소개할 동안 머리를 쥐어 짰습니다. 면접관분들의 눈치를 보니 우선 자기소개 긴 것은 호감가지 않을 듯해서 '최대한 간결하고 뭐하는 사람인지만 알려주자'라고 생각하고 자기소개는 끝났습니다.</p>
                <p><span class="fw-bold">프로젝트</span>는 두 말 할 것 없이 이미 포폴이 첨부안된 상태로 진행한 면접이라 망했다 생각하고 천천히 했던 내용을 이야기했습니다. 물론 이 또한 말하는 연습을 못, 아니 안했습니다. CS질문만 나올줄 알았던 저는 CS만 주구장창 보고있었으니까요... 프로젝트 질문에 응답할 때 지원자들의 말을 조금 정리해보자면 어떤 기능을 써서 어떻게 데이터를 처리하고 데이터를 어디에서 받아 누구에게 제공을 한다는 일련의 과정을 포함해서 말을 했던 기억이 납니다. "저는 그저 어떤 기능 있습니다. 버튼 누르면 뭐가 스크랩이 됩니다." 로 끝나버려서 매우매우매우매우매우 아쉽고도 후회스러웠습니다.
                프로젝트 관련 질문은 크게 분류하면 아래와 같습니다.</p>
                <ol class="toc mb-5">
                    <li>이 프로젝트는 왜 만들었나? (무슨 목적을 가지고 만들었는지)</li>
                    <li>프로젝트 참여 인원은?</li>
                    <li>기억나는게 여기까지</li>
                </ol>
                <p><span class="fw-bold">코딩테스트</span>는 저한테 비교적 어려웠습니다. 문제는 회사와 관련된 거라 공개는 안 될 것 같구요. 면접관 의견은 코테가 아주 쉬웠다고 하는데 너무 자바를 놓고 있었나 하는 생각이 많이 들었습니다. 코딩테스트를 본 목적은 면접 당락에 뜻이 있기보다는 코딩 습관이나 문제해결 능력, 생각 등을 듣고 싶어하는 듯 했습니다.</p>
                <p><span class="fw-bold">자기계발</span>에 대한 질문도 있는데요. 어떻게 성장하는지와 자기계발에 소홀해서 발전이 없는 사람은 아닌가 하는 취지로 묻는 듯 했습니다. 회사는 서로 같은 방향으로 이익을 추구하는 곳이기 때문에 개개인이 발전할 의지가 없으면 회사 또한 발전이 더뎌지니 이러한 질문은 어디든 궁금해하지 않을까 생각합니다.</p>
                <p>마지막으로 <span class="fw-bold">취미</span>에 대한 질문인데요. 누군가는 "왜 취미를 물어?"라고 할 수 있지만 어떻게 보면 회사에서 일을 하면 당연히 스트레스를 받게 되고 이러한 스트레스를 어떻게 해소하는지를 묻는 취지인 것 같습니다.</p>

                <div>
                    <span class="fs-5 fw-bold">이번 면접 결론</span>
                </div>
                <div>
                    <ul class="toc mb-5">
                        <li>자기소개를 간결하면서 핵심 단어로 표현 할 수 있도록 해야겠다.</li>
                        <li>1일 1코딩테스트를 해서 알고리즘과 친해지자</li>
                        <li>포트폴리오 첨부되었는지 확인하자</li>
                        <li>프로젝트의 핵심 기능을 견고하게 구현하고 짜임새 있게 설명할 수 있도록 정리를 잘 해두자. 100가지 기능보다는 1가지 제대로 된 기능을...</li>
                        <li>더 이상 뭔 만들어 낼게 아니라 심도 있게 심혈을 기울인 웹앱을 하나 만들자. 컨셉부터 구현, 서비스까지...</li>
                        <li>자기계발 어필을 단계 있게 하자. 단순히 "저 공부 열심히해요!" 보다는 "현재 spring boot를 하면서 데이터베이스를 보다 효율적으로 사용하기 위해 mybatis를 공부 중이며, 나아가 하이버네이트와 jpa를 공부할 계획입니다. 어쩌고 저쩌고..."가 스토리 있고 명분이 생겨서 노력한다는 느낌을 줄 수 있을 것 같다.</li>
                    </ul>
                </div>
            </div>
            <blockquote class="blockquote blockquote-info">회사는 거론하지 않고 내용만 정리하는 것을 원칙으로 하고 있습니다! 불편한 내용이 있으면 제보해주시면 감사하겠습니다.</blockquote>
        </div>
    `],
    ref: [
        // {
        //     name:'위키 백과 - CS',
        //     link:'https://ko.wikipedia.org/wiki/%EC%93%B0%EB%A0%88%EA%B8%B0_%EC%88%98%EC%A7%91_(%EC%BB%B4%ED%93%A8%ED%84%B0_%EA%B3%BC%ED%95%99)'
        // },
    ],
    template(){
        this.title = this.origin.name;
        
        return `
            ${wikiFilter.all.call(this)}
        `
    }
}