const interview = {
    modified: '2022-01-03 16:02:42',
    done: true,
    published: true,
    title: '인터뷰를 정리하자',
    tags: ['인터뷰를 정리하자'],
    categories: ['CS'],
    authors: ['kimson'],
    wrote: '2021-12-06 18:14:35',
    toc: false,
    content: [`
        <div>
            <div class="mt-3">
                <span class="h3">모 회사 1차 면접</span>
            </div>
            <div>
                <div>
                    <span class="h6">면접 분위기</span>
                </div>
                <p>면접을 보기 위해 아침 일찍 나와야 했습니다. 출근시간보다 더 빠른 시간에 보는 게 지방에 사는 저로서는 오는 길조차 체력의 반을 써야했습니다. 재량을 두고 저를 알리는 자리이니 이러한 불편은 감수해야하지만 힘든건 부정 못하겠네요.</p>
                <p>면접은 난생 처음 <kbd>다대다</kbd>방식. 심지어 면접도 형식 갖춰서 하는 경험도 전무했던지라 머리가 새하얗게 비었습니다. (이전 직장은 상무님 아들얘기만 듣다가 끝난던 기억이)</p>
                <div>
                    <span class="h6">면접 질문</span>
                </div>
                <p>그렇게 어려운 질문을 없었습니다만, 물론 준비 못한 저는 어려웠습니다. 실컷 파일로 만들어둔 포트폴리오를 첨부도 못하고 면접 도중에 알았으니 속으로는 너무 당황해서 머리가 새하얘졌습니다.</p>
                <p>각설하고 질문은 크게 <span class="fw-bold">자기소개</span>, <span class="fw-bold">프로젝트 관련</span>, <span class="fw-bold">코딩테스트</span> 관련 질문, <span class="fw-bold">자기계발</span> 등의 질문이었습니다.</p>
                <p><span class="fw-bold">자기소개</span>는 그저 저는 누구예요 하고 끝나는 것으로 생각했던 저는 불행 중 불행으로 두번째 순번이었고, 기가막히게 옆 사람이 자기소개할 동안 머리를 쥐어 짰습니다. 면접관분들의 눈치를 보니 우선 자기소개 긴 것은 호감가지 않을 듯해서 '최대한 간결하고 뭐하는 사람인지만 알려주자'라고 생각하고 자기소개는 끝났습니다.</p>
                <p><span class="fw-bold">프로젝트</span>는 두 말 할 것 없이 이미 포폴이 첨부안된 상태로 진행한 면접이라 망했다 생각하고 천천히 했던 내용을 이야기했습니다. 물론 이 또한 말하는 연습을 못, 아니 안했습니다. CS질문만 나올줄 알았던 저는 CS만 주구장창 보고있었으니까요... 프로젝트 질문에 응답할 때 지원자들의 말을 조금 정리해보자면 어떤 기능을 써서 어떻게 데이터를 처리하고 데이터를 어디에서 받아 누구에게 제공을 한다는 일련의 과정을 포함해서 말을 했던 기억이 납니다. "저는 그저 어떤 기능 있습니다. 버튼 누르면 뭐가 스크랩이 됩니다." 로 끝나버려서 매우매우매우매우매우 아쉽고도 후회스러웠습니다.
                프로젝트 관련 질문은 크게 분류하면 아래와 같습니다.</p>
                <ol class="toc mb-5">
                    <li>이 프로젝트는 왜 만들었나? (무슨 목적을 가지고 만들었는지)</li>
                    <li>프로젝트 참여 인원은?</li>
                    <li>기억나는게 여기까지</li>
                </ol>
                <p><span class="fw-bold">코딩테스트</span>는 저한테 비교적 어려웠습니다. 문제는 회사와 관련된 거라 공개는 안 될 것 같구요. 면접관 의견은 코테가 아주 쉬웠다고 하는데 너무 자바를 놓고 있었나 하는 생각이 많이 들었습니다. 코딩테스트를 본 목적은 면접 당락에 뜻이 있기보다는 코딩 습관이나 문제해결 능력, 생각 등을 듣고 싶어하는 듯 했습니다.</p>
                <p><span class="fw-bold">자기계발</span>에 대한 질문도 있는데요. 어떻게 성장하는지와 자기계발에 소홀해서 발전이 없는 사람은 아닌가 하는 취지로 묻는 듯 했습니다. 회사는 서로 같은 방향으로 이익을 추구하는 곳이기 때문에 개개인이 발전할 의지가 없으면 회사 또한 발전이 더뎌지니 이러한 질문은 어디든 궁금해하지 않을까 생각합니다.</p>
                <p>마지막으로 <span class="fw-bold">취미</span>에 대한 질문인데요. 누군가는 "왜 취미를 물어?"라고 할 수 있지만 어떻게 보면 회사에서 일을 하면 당연히 스트레스를 받게 되고 이러한 스트레스를 어떻게 해소하는지를 묻는 취지인 것 같습니다.</p>

                <div>
                    <span class="fs-5 fw-bold">이번 면접 결론</span>
                </div>
                <div>
                    <ul class="toc mb-5">
                        <li>자기소개를 간결하면서 핵심 단어로 표현 할 수 있도록 해야겠다.</li>
                        <li>1일 1코딩테스트를 해서 알고리즘과 친해지자</li>
                        <li>포트폴리오 첨부되었는지 확인하자</li>
                        <li>프로젝트의 핵심 기능을 견고하게 구현하고 짜임새 있게 설명할 수 있도록 정리를 잘 해두자. 100가지 기능보다는 1가지 제대로 된 기능을...</li>
                        <li>더 이상 뭔 만들어 낼게 아니라 심도 있게 심혈을 기울인 웹앱을 하나 만들자. 컨셉부터 구현, 서비스까지...</li>
                        <li>자기계발 어필을 단계 있게 하자. 단순히 "저 공부 열심히해요!" 보다는 "현재 spring boot를 하면서 데이터베이스를 보다 효율적으로 사용하기 위해 mybatis를 공부 중이며, 나아가 하이버네이트와 jpa를 공부할 계획입니다. 어쩌고 저쩌고..."가 스토리 있고 명분이 생겨서 노력한다는 느낌을 줄 수 있을 것 같다.</li>
                    </ul>
                </div>
            </div>
            <blockquote class="blockquote blockquote-info">회사는 거론하지 않고 내용만 정리하는 것을 원칙으로 하고 있습니다! 불편한 내용이 있으면 제보해주시면 감사하겠습니다.</blockquote>
        </div>
    `,
    `
    <div>
        <div class="mt-3">
            <span class="h3">모 회사 2차 면접</span>
        </div>
        <div>
            <div>
                <span class="h6">면접 분위기</span>
            </div>
            <p>1차와 다르게 질문과 말하는 어조로 보아 압박면접의 느낌이었습니다. 이 또한 다대다의 면접으로 심지어 면접관, 지원자가 1명씩 더 추가되어 진행됐습니다. 이번에는 임원 면접이기에 회사에 대해 물어볼 것을 대비해 회사 공부를 열심히 했지만 흐름읽기에 실패하고 질문은 거의 기술면접과 유사했습니다.</p>
            <div>
                <span class="h6">면접 질문</span>
            </div>
            <p>
                크게 질문의 종류는 <span class="fw-bold">자기소개</span>, <span class="fw-bold">다른 개발자보다 뛰어난 강점</span>, <span class="fw-bold">어떤 언어를 주로 사용하는지</span>, 즉석에서 추가된 질문이었지만 <span class="fw-bold">TDD와 관련하여 오류 처리를 어떻게 하는지</span> 였습니다.
            </p>
            <div>
                <span class="h6">면접 질문 이후 느낌 점</span>
            </div>
            <p>
                우선 내 자신이 어느 위치에 있는지 파악되는 좋은 계기였고, 지원자 중에서 가장 이론적으로, 기술적으로 떨어지는 느낌을 받아 자극이 되고 어떤 점들을 배워야할 지 눈에 더 명확해지는 느낌이 들었습니다.
            </p>
            <p>
                현재 역량으로는 매우 부족하다는 현실을 다시 알려주었고, 흐지부지하던 JPA공부와 TDD를 먼저 정리해야겠다는 생각이 들고, 코딩을 하면서 클린 코드를 어떻게 짜면 좋을지에 대한 생각과 노력을 했지만 정작 그에 대해서는 아무 언급하지 못하고 어필을 못 한 게 너무 아쉬우면서도 말하지 못했다는 게 심도 있게 다루지 않았기에 그 말이 차마 나오지 못한 것 같아 많은 생각이 듭니다.
            </p>
            <p>
                그래도 꾸준히 하루에 조금씩 발전하고 새로운 것에 도전한다는 말은 전했으니 속은 후련합니다. 특출나게 잘하는 기술은 없지만 문제가 해결될 때까지 붙잡고 있는 것 하나는 그 누가와도 지지않을 자신이 있기 때문에 조만간 좋은 소식을 인터뷰 정리에 올리지 않을까 싶습니다.
            </p>
            <p>
                <span class="tag tag-danger">결과</span>
                <span>불합</span>
            </p>
        </div>
    </div>
    `,
    `
    <div>
        <div class="mt-3">
            <span class="h3">이후 목표</span>
        </div>
        <div>
            <div>
                <span class="h6">느낀 점</span>
            </div>
            <p>
                면접이 끝나고 거의 한 달이 되어갑니다. 면접을 보고 느낌 점은 많습니다만, 몇 가지 생각을 정리하자면 내가 얼마나 아느냐 보다는 얼마나 공부하는 의지가 있고 자신만의 강점이 있는지와 툴을 잘 쓰는게 아닌 내용을 잘 숙지하고 있는가에 좀 더 초점을 두려합니다.
            </p>
            <p>
                현재 자바스크립트로 여러 기능을 만들어 봤지만 딱 잘라 말했을 때 "프로젝트"라고 하기에는 너무 작은 부품과도 같은 기능만을 만들어 냈습니다. 물론 이런저런 기능만으로 승부하려한건 아니지만 도움이 되겠지 싶어서 시작한 것들이 지금에 와서는 오히려 독이 되었다 생각됩니다.
            </p>
            <p>
                부질없는 짓은 아니지만 면접에 플러스되는 요인은 아니라고 봅니다. 단순히 기능하나 만들고 일희일비 하는 것보다 제대로 프로젝트 하나를 완성시켜서 거기에 대한 내용을 쭉 설명하고, 혹은 배포도 해보면서 서비스하고, 요구사항에 유동적으로 대처하는 등의 기술을 더 중요시 한다는 느낌을 받았습니다.
            </p>
            <p>
                도움이 될 정보는 아니지만 저와 같은 처지인 분들은 힘내시길.
            </p>
        </div>
    </div>
    `
    ],
    ref: [
        // {
        //     name:'위키 백과 - CS',
        //     link:'https://ko.wikipedia.org/wiki/%EC%93%B0%EB%A0%88%EA%B8%B0_%EC%88%98%EC%A7%91_(%EC%BB%B4%ED%93%A8%ED%84%B0_%EA%B3%BC%ED%95%99)'
        // },
    ]
}